In [1]:
import pandas as pd

In [3]:
var=pd.DataFrame({'A':[1,2,3,233,4],'B':[4,3,5,4,43]})

In [4]:
var

     A   B
0    1   4
1    2   3
2    3   5
3  233   4
4    4  43

##### var.insert(index postion for column,name , data)

In [5]:
var.insert(1,'python',var['A'])

In [6]:
var

     A  python   B
0    1       1   4
1    2       2   3
2    3       3   5
3  233     233   4
4    4       4  43

In [7]:
var['p']=var['A'][:2]

In [8]:
var

     A  python   B    p
0    1       1   4  1.0
1    2       2   3  2.0
2    3       3   5  NaN
3  233     233   4  NaN
4    4       4  43  NaN

In [9]:
var1=var.pop('P')

In [10]:
var1

0      1
1      2
2      3
3    233
4      4
Name: A, dtype: int64

In [ ]:
var